tests/applications/results/sqlite/ycsb_a/run_6.out
Adding shard node URL: jdbc:sqlite://home/harveylu/hello.db
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 5640
[OVERALL], Throughput(ops/sec), 177.3049645390071
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 497
[READ], AverageLatency(us), 75.9476861167002
[READ], MinLatency(us), 29
[READ], MaxLatency(us), 279
[READ], 95thPercentileLatency(us), 130
[READ], 99thPercentileLatency(us), 198
[READ], Return=OK, 497
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 452.0
[CLEANUP], MinLatency(us), 452
[CLEANUP], MaxLatency(us), 452
[CLEANUP], 95thPercentileLatency(us), 452
[CLEANUP], 99thPercentileLatency(us), 452
[UPDATE], Operations, 503
[UPDATE], AverageLatency(us), 10817.9324055666
[UPDATE], MinLatency(us), 7988
[UPDATE], MaxLatency(us), 27935
[UPDATE], 95thPercentileLatency(us), 11519
[UPDATE], 99thPercentileLatency(us), 22399
[UPDATE], Return=OK, 503