tests/applications/results/sqlite/ycsb_a/run_hase_4.out
Adding shard node URL: jdbc:sqlite://home/harveylu/hello.db
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 5803
[OVERALL], Throughput(ops/sec), 172.32465965879717
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 484
[READ], AverageLatency(us), 76.79338842975207
[READ], MinLatency(us), 30
[READ], MaxLatency(us), 304
[READ], 95thPercentileLatency(us), 130
[READ], 99thPercentileLatency(us), 197
[READ], Return=OK, 484
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 543.0
[CLEANUP], MinLatency(us), 543
[CLEANUP], MaxLatency(us), 543
[CLEANUP], 95thPercentileLatency(us), 543
[CLEANUP], 99thPercentileLatency(us), 543
[UPDATE], Operations, 516
[UPDATE], AverageLatency(us), 10849.624031007752
[UPDATE], MinLatency(us), 7888
[UPDATE], MaxLatency(us), 28703
[UPDATE], 95thPercentileLatency(us), 11591
[UPDATE], 99thPercentileLatency(us), 22735
[UPDATE], Return=OK, 516